bites_review/app/controllers/api/v1/comments_controller.rb

  def index
    @comments = Item.find(params[:item_id]).comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 20]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

  def create
    @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("content", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "klkfjjklsdf"], ["item_id", 28], ["created_at", "2019-01-23 22:09:52.687969"], ["updated_at", "2019-01-23 22:09:52.687969"]]