bites_review/app/controllers/api/v1/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."name" = ? LIMIT ?  [["name", "Seva"], ["LIMIT", 1]]
---
  def search
    @restaurant = Restaurant.find_by(name: restaurant_params[:name])